{
  "movies": [
    {
      "id": 0,
      "name": "Men in Black",
      "genere": "Action",
      "poster": "https://images-s.kinorium.com/movie/poster/108378/w1500_3587428.jpg",
      "year": 1997,
      "descr": "After a police chase with an otherworldly being,\n      a New York City cop is recruited as an agent in a top-secret \n      organization established to monitor and police alien activity on Earth:\n      the Men in Black. Agent Kay and new recruit Agent Jay find themselves \n      in the middle of a deadly plot by an intergalactic terrorist who has \n      arrived on Earth to assassinate two ambassadors from opposing \n      galaxies.",
      "lenght": "1h 38m"
    },
    {
      "id": 1,
      "name": "The Truman Show",
      "genere": "Drama",
      "poster": "https://images-s.kinorium.com/movie/poster/109024/w1500_3587619.jpg",
      "year": 1998,
      "descr": "Truman Burbank is the star of The Truman Show, a 24-hour-a-day reality TV show that broadcasts every aspect of his life without his knowledge. His entire life has been an unending soap opera for consumption by the rest of the world. And everyone he knows, including his wife and his best friend is really an actor, paid to be part of his life.",
      "lenght": "1h 43m"
    },
    {
      "id": 2,
      "name": "Whiplash",
      "genere": "Drama",
      "poster": "https://images-s.kinorium.com/movie/poster/680490/w1500_3561090.jpg",
      "year": 2014,
      "descr": "Under the direction of a ruthless instructor, a talented young drummer begins to pursue perfection at any cost, even his humanity.",
      "lenght": "1h 46m"
    },
    {
      "id": 3,
      "name": "Monsters, Inc.",
      "genere": "Animation",
      "poster": "https://images-s.kinorium.com/movie/poster/163075/w1500_3468163.jpg",
      "year": 2001,
      "descr": "James Sullivan and Mike Wazowski are monsters, they earn their living scaring children and are the best in the business… even though they’re more afraid of the children than they are of them. When a child accidentally enters their world, James and Mike suddenly find that kids are not to be afraid of and they uncover a conspiracy that could threaten all children across the world.",
      "lenght": "1h 32m"
    },
    {
      "id": 4,
      "name": "Star Wars: Episode IV - A New Hope",
      "genere": "Action",
      "poster": "https://images-s.kinorium.com/movie/poster/71037/w1500_50293534.jpg",
      "year": 1977,
      "descr": "Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker and dashing captain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.",
      "lenght": "2h 1m"
    },
    {
      "id": 5,
      "name": "Watchmen",
      "genere": "Action",
      "poster": "https://images-s.kinorium.com/movie/poster/314384/w1500_3482131.jpg",
      "year": 2009,
      "descr": "In a gritty and alternate 1985 the glory days of costumed vigilantes have been brought to a close by a government crackdown, but after one of the masked veterans is brutally murdered, an investigation into the killer is initiated. The reunited heroes set out to prevent their own destruction, but in doing so uncover a sinister plot that puts all of humanity in grave danger.",
      "lenght": "2h 42m"
    },
    {
      "id": 6,
      "name": "The Ballad of Buster Scruggs",
      "genere": "Comedy",
      "poster": "https://images-s.kinorium.com/movie/poster/1606442/w1500_3584150.jpg",
      "year": 2018,
      "descr": "Vignettes weaving together the stories of six individuals in the old West at the end of the Civil War. Following the tales of a sharp-shooting songster, a wannabe bank robber, two weary traveling performers, a lone gold prospector, a woman traveling the West to an uncertain future, and a motley crew of strangers undertaking a carriage ride.",
      "lenght": "2h 13m"
    },
    {
      "id": 7,
      "name": "The Matrix",
      "genere": "Action",
      "poster": "https://images-s.kinorium.com/movie/poster/116780/w1500_50937661.jpg",
      "year": 1999,
      "descr": "Set in the 22nd century, The Matrix tells the story of a computer hacker who joins a group of underground insurgents fighting the vast and powerful computers who now rule the earth.",
      "lenght": "2h 16m"
    },
    {
      "id": 8,
      "name": "Klaus",
      "genere": "Animation",
      "poster": "https://images-s.kinorium.com/movie/poster/1555565/w1500_50276895.jpg",
      "year": 2019,
      "descr": "When Jesper distinguishes himself as the Postal Academy’s worst student, he is sent to Smeerensburg, a small village located on an icy island above the Arctic Circle, where grumpy inhabitants barely exchange words, let alone letters. Jesper is about to give up and abandon his duty as a postman when he meets local teacher Alva and Klaus, a mysterious carpenter who lives alone in a cabin full of handmade toys.",
      "lenght": "1h 36m"
    },
    {
      "id": 9,
      "name": "Full Metal Jacket",
      "genere": "Drama",
      "poster": "https://images-s.kinorium.com/movie/poster/85360/w1500_3579294.jpg",
      "year": 1987,
      "descr": "A pragmatic U.S. Marine observes the dehumanizing effects the U.S.-Vietnam War has on his fellow recruits from their brutal boot camp training to the bloody street fighting in Hue.",
      "lenght": "1h 56m"
    }
  ]
}
